// 1. Написать программу, которая выводит среднее
// арифметическое n чисел введенных пользователем.
// Ввод чисел прекращается
// тогда, когда нажали «отмена», после чего выводится
// среднее арифметическое.

// let itog = 1;
// let n = +prompt (`Enter a number!`);
// for (i = 1; n !== null || n !== 0; i++) {
//     +prompt (`Enter a number!`, ``);
//     itog = 
//     console.log (itog);
// }

// 2. Пользователь вводит два числа n и m, с помощью цикла вывести квадраты всех
// чисел от n до m.
// Например:
// Ввели число 2
// Ввели число 5
// выводим: 2*2 потом 3*3 потом 4*4 потом 5*5

// 3. Написать программу, в которой пользователя просят ввести числа 5 раз. Причем
// каждое последующее число должно быть больше предыдущего, иначе вывести
// ошибку.

// let num1 = +prompt (`Enter 1 number`, ``);
// let num2 = +prompt (`Enter 2 number`, ``);
// let num3 = +prompt (`Enter 3 number`, ``);
// let num4 = +prompt (`Enter 4 number`, ``);
// let num5 = +prompt (`Enter 5 number`, ``);

// let num = +prompt (`Enter a number`);
// let num1 = num;
// for (let i= 5; i !== 1; i--) {
//     +prompt (`Enter a number`);
//     if (num > num+1) {
//         alert (`Error!`);
//         {break};
//     }
// }
// console.log (`Good job!`);



// if (num1 < num2) {
//     console.log ("Yes");
// } else {console.log ("Error")};
// if (num2 < num3) {
//     console.log ("Yes");
// } else {console.log ("Error")};
// if (num3 < num4) {
//     console.log ("Yes");
// } else {console.log ("Error")};
// if (num4 < num5) {
//     console.log ("Yes");
// } else {
//     console.log ("Error!");
// }

///////////////////////////////////////////////////////////////////

// 4. Написать программу-заику. Пользователь вводит число. Вывести количество "за"
// (в слове "заика") равное этому числу.
// Например:
// Вводим 3
// Программа выводит "зазазаика"
// Вводим 5
// Программа выводит "зазазазазаика"

// let num = +prompt (`Введите число!`);
// za = `за`;

// for (let i = 0; num > i; i++) {
//     if (num === i) {
//         {break}
//     }
// alert (za .repeat (+num) + `ика`);
//     {break}
// }

//////////////////////////////////////////////////////////////////////////