// 1. Создайте путой массив. С помощью цикла заполните массив числами, где каждое число
// равно квадрату своего номера. (длина массива должна быть 10)

// Задача 1. Решение.

// let arr = [];
// let i = 0;
//     for (; i < 10; ++i ) {
//         arr.push ([i]);
//             for (n= arr.indexOf ([i]); n === i; ++n) {
//                 continue
//             }
//         let square = n * i;
//         console.log (square);
//     }
//     console.log (typeof arr);
//     console.log (arr);

/////////////////////////////////////////////////////////////////////////////////

// 2. Создать случайный массив из 10 чисел. Вывести на экран
// количество четных чисел из этого массива.

// const arr = ["10", "29", "35", "56", "48", "45", "18", "78", "9", "12"];
// let i = 0;
// let evenArr = []; 

// console.log (arr[4]);

// for (; i < arr.length; i++) {
//     if ()
// }

// 3. Создать случайный массив из 10 чисел. Вывести на экран
// наибольшее число из этого массива.

///////////////////////////////////////////////////////////////////////////////////////////////

// 4. Дана строка «Мы любим JavaScript». Используя
// метод split, создайте на основе это строки
// массив.(Вывод данных: Мы,любим,JavaScript).

// Задача 4. Решение.

// let str = `Мы любим JavaScript`;
// alert (str.split (` `));
// console.log (typeof str.split (` `));

/////////////////////////////////////////////////////////////////////////////////////////////

// 5.Дан массив ["Мы","любим","JavaScript"]. Используя
// метод join, создайте и выведите строку. В качестве
// разделителя используйте "!" (Вывод данных: Мы!любим!JavaScript).

// Задача 5. Решение.

// const arr = ["Мы","любим","JavaScript"];
// alert (arr.join(`!`));

////////////////////////////////////////////////////////////////////////////////////////////

// 6.Дан массив ["Я","великий","программист!"] с
// помощью метода indexOf, вывести на экран
// номер позиции строки "программист!"

// Задача 6. Решение.

// const arr = [ `Я`, `великий`, `программист!`];
// alert (arr.indexOf (`программист!`));

////////////////////////////////////////////////////////////////////////////////////////////////