// Задача 1

// Пользователь вводит 2 числа, вывести в консоль большее из них

// Задача 1. Решение

// let num1 = prompt ('Введите первое число!');
// let num2 = prompt ('Введите второе число!');

// if (num1 > num2) {
//     console.log ("Первое число больше");
// } else if (num1 === null || num2 === null) {
//     console.log ("Вы ничего не ввели");
// } else if (num1 === num2) {
//     console.log ("Числа равны");
// } else {
//     console.log ("Второе число больше")
// }

/////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 2

// Пользователь вводит 3 числа, первые два это числа которые он хочет перемножить
// третье число, это результат умножения по мнению пользователя
// выяснить правильно ли ответил пользователь и вывести в консоль ОК если правильно
// NOT OK {rightAnswer} если неправильно
// const num1 = +prompt('enter num1');
// const num2 = +prompt('enter num2');
// const userResult = +prompt('enter result');

// Задача 2. Решение

// const rightAnswer = num1 * num2;

// if (userResult === rightAnswer) {
//     console.log('OK');
// } else {
//     console.log(`NOT OK ${rightAnswer}`);
// }

